# vsoInsertParamWidget

## Description
Sets a widget to appear in the Object Info Palette.

```pascal
FUNCTION vsoInsertParamWidget(
				position    : LONGINT;
				parameterID : LONGINT;
				text        : STRING;
				data        : LONGINT) : BOOLEAN;
```

```python

def vs.vsoInsertParamWidget(position, parameterID, text, data):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|position|LONGINT||
|parameterID|LONGINT||
|text|STRING||
|data|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events